def area(a, b):
    """
    Параметры:
        a - вещественное число, одна сторона прямоугольника
        b - вещественное число, другая сторона прямоугольника
    Возвращаемое значение:
        вещественное число, площадь прямоугольника с заданными сторонами (a, b)
    """
    return a * b


def perimeter(a, b):
    """
    Параметры:
        a - вещественное число, одна сторона прямоугольника
        b - вещественное число, другая сторона прямоугольника
    Возвращаемое значение:
        вещественное число, периметр прямоугольника с заданными сторонами (a, b)
    """
    return (a + b) * 2