
def area(a):
    """
    Нахождение площади квадрата с заданной стороной
    -> area(5)
    25
    Параметры:
        a - вещественное число, сторона квадрата
    Возвращаемое значение:
        вещественное число, площадь прямоугольника с заданными сторонами (a)
    """
    return a * a


def perimeter(a):
    """
    Нахождение периметра квадрата с заданной стороной
    -> perimeter(5)
    20
    Параметры:
        a - вещественное число, сторона квадрата
    Возвращаемое значение:
        вещественное число, периметр прямоугольника с заданными сторонами (a)
    """
    return 4 * a
